{"format": "keras", "nodes": [{"name": "input_6", "id": "input_6", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "efficientnetb4", "id": "efficientnetb4", "class_name": "Functional", "output_shape": [null, 7, 7, 1792], "num_parameters": 17673823}, {"name": "global_average_pooling2d_2", "id": "global_average_pooling2d_2", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1792], "num_parameters": 0}, {"name": "dropout_2", "id": "dropout_2", "class_name": "Dropout", "output_shape": [null, 1792], "num_parameters": 0}, {"name": "dense_2", "id": "dense_2", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 1793}], "edges": [["input_6", "efficientnetb4"], ["efficientnetb4", "global_average_pooling2d_2"], ["global_average_pooling2d_2", "dropout_2"], ["dropout_2", "dense_2"]]}