{"format": "keras", "nodes": [{"name": "input_4", "id": "input_4", "class_name": "InputLayer", "output_shape": [[null, 96, 96, 3]], "num_parameters": 0}, {"name": "mobilenetv2_1.00_96", "id": "mobilenetv2_1.00_96", "class_name": "Functional", "output_shape": [null, 3, 3, 1280], "num_parameters": 2257984}, {"name": "global_average_pooling2d_1", "id": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dropout_1", "id": "dropout_1", "class_name": "Dropout", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 1281}], "edges": [["input_4", "mobilenetv2_1.00_96"], ["mobilenetv2_1.00_96", "global_average_pooling2d_1"], ["global_average_pooling2d_1", "dropout_1"], ["dropout_1", "dense_1"]]}