{"format": "keras", "nodes": [{"name": "input_3", "id": "input_3", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "mobilenetv2_1.00_224", "id": "mobilenetv2_1.00_224", "class_name": "Functional", "output_shape": [null, 7, 7, 1280], "num_parameters": 2257984}, {"name": "global_average_pooling2d", "id": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dropout", "id": "dropout", "class_name": "Dropout", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 1281}], "edges": [["input_3", "mobilenetv2_1.00_224"], ["mobilenetv2_1.00_224", "global_average_pooling2d"], ["global_average_pooling2d", "dropout"], ["dropout", "dense_1"]]}