{"format": "keras", "nodes": [{"name": "input_5", "id": "input_5", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "efficientnetb4", "id": "efficientnetb4", "class_name": "Functional", "output_shape": [null, 7, 7, 1792], "num_parameters": 17673823}, {"name": "global_average_pooling2d_1", "id": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1792], "num_parameters": 0}, {"name": "dropout_1", "id": "dropout_1", "class_name": "Dropout", "output_shape": [null, 1792], "num_parameters": 0}, {"name": "dense_2", "id": "dense_2", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 1793}], "edges": [["input_5", "efficientnetb4"], ["efficientnetb4", "global_average_pooling2d_1"], ["global_average_pooling2d_1", "dropout_1"], ["dropout_1", "dense_2"]]}