{"format": "keras", "nodes": [{"name": "input_2", "id": "input_2", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "efficientnetb4", "id": "efficientnetb4", "class_name": "Functional", "output_shape": [null, 7, 7, 1792], "num_parameters": 17673823}, {"name": "global_average_pooling2d", "id": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1792], "num_parameters": 0}, {"name": "dropout", "id": "dropout", "class_name": "Dropout", "output_shape": [null, 1792], "num_parameters": 0}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 1793}], "edges": [["input_2", "efficientnetb4"], ["efficientnetb4", "global_average_pooling2d"], ["global_average_pooling2d", "dropout"], ["dropout", "dense"]]}